---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarInSystem.IsUnobscuredInView(Autodesk.Revit.DB.View)
source: html/ec52158a-a6df-dc13-545e-9543854728ad.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.IsUnobscuredInView Method

Checks if this rebar element is shown unobscured in a view.

## Syntax (C#)
```csharp
public bool IsUnobscuredInView(
	View view
)
```

## Parameters
- **view** (`Autodesk.Revit.DB.View`) - The view element

## Returns
True if rebar is shown unobscured, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null